; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-18)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	city23 - city
	city24 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city24)
	(fuel-level plane1 fl4)
	(at plane2 city11)
	(fuel-level plane2 fl3)
	(at plane3 city14)
	(fuel-level plane3 fl0)
	(at plane4 city20)
	(fuel-level plane4 fl1)
	(at plane5 city18)
	(fuel-level plane5 fl6)
	(at plane6 city13)
	(fuel-level plane6 fl3)
	(at plane7 city10)
	(fuel-level plane7 fl4)
	(at person1 city18)
	(at person2 city16)
	(at person3 city17)
	(at person4 city5)
	(at person5 city5)
	(at person6 city23)
	(at person7 city11)
	(at person8 city10)
	(at person9 city23)
	(at person10 city12)
	(at person11 city4)
	(at person12 city5)
	(at person13 city20)
	(at person14 city10)
	(at person15 city18)
	(at person16 city3)
	(at person17 city14)
	(at person18 city11)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane3 city11)
	(at person2 city10)
	(at person3 city19)
	(at person4 city8)
	(at person5 city12)
	(at person6 city7)
	(at person7 city10)
	(at person8 city19)
	(at person9 city19)
	(at person10 city11)
	(at person11 city4)
	(at person12 city21)
	(at person13 city13)
	(at person14 city18)
	(at person15 city24)
	(at person16 city23)
	(at person17 city10)
	(at person18 city21)
	))

)

; plan
1. (board person8 plane7 city10)
   deleted: (at person8 city10)
   added: (in person8 plane7)
   goals met: 1 of 18
2. (board person14 plane7 city10)
   deleted: (at person14 city10)
   added: (in person14 plane7)
   goals met: 1 of 18
3. (zoom plane7 city10 city18 fl4 fl3 fl2)
   deleted: (at plane7 city10) (fuel-level plane7 fl4)
   added: (at plane7 city18) (fuel-level plane7 fl2)
   goals met: 1 of 18
4. (debark person14 plane7 city18)
   deleted: (in person14 plane7)
   added: (at person14 city18)
   goals met: 2 of 18
5. (zoom plane7 city18 city19 fl2 fl1 fl0)
   deleted: (at plane7 city18) (fuel-level plane7 fl2)
   added: (at plane7 city19) (fuel-level plane7 fl0)
   goals met: 2 of 18
6. (debark person8 plane7 city19)
   deleted: (in person8 plane7)
   added: (at person8 city19)
   goals met: 3 of 18
7. (board person15 plane5 city18)
   deleted: (at person15 city18)
   added: (in person15 plane5)
   goals met: 3 of 18
8. (zoom plane5 city18 city24 fl6 fl5 fl4)
   deleted: (at plane5 city18) (fuel-level plane5 fl6)
   added: (at plane5 city24) (fuel-level plane5 fl4)
   goals met: 3 of 18
9. (debark person15 plane5 city24)
   deleted: (in person15 plane5)
   added: (at person15 city24)
   goals met: 4 of 18
10. (board person13 plane4 city20)
   deleted: (at person13 city20)
   added: (in person13 plane4)
   goals met: 4 of 18
11. (fly plane4 city20 city13 fl1 fl0)
   deleted: (at plane4 city20) (fuel-level plane4 fl1)
   added: (at plane4 city13) (fuel-level plane4 fl0)
   goals met: 4 of 18
12. (debark person13 plane4 city13)
   deleted: (in person13 plane4)
   added: (at person13 city13)
   goals met: 5 of 18
13. (refuel plane3 city14 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 18
14. (board person17 plane3 city14)
   deleted: (at person17 city14)
   added: (in person17 plane3)
   goals met: 5 of 18
15. (board person7 plane2 city11)
   deleted: (at person7 city11)
   added: (in person7 plane2)
   goals met: 5 of 18
16. (board person18 plane2 city11)
   deleted: (at person18 city11)
   added: (in person18 plane2)
   goals met: 5 of 18
17. (zoom plane2 city11 city10 fl3 fl2 fl1)
   deleted: (at plane2 city11) (fuel-level plane2 fl3)
   added: (at plane2 city10) (fuel-level plane2 fl1)
   goals met: 5 of 18
18. (debark person7 plane2 city10)
   deleted: (in person7 plane2)
   added: (at person7 city10)
   goals met: 6 of 18
19. (fly plane2 city10 city21 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city21) (fuel-level plane2 fl0)
   goals met: 6 of 18
20. (debark person18 plane2 city21)
   deleted: (in person18 plane2)
   added: (at person18 city21)
   goals met: 7 of 18
21. (fly plane3 city14 city10 fl1 fl0)
   deleted: (at plane3 city14) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 7 of 18
22. (refuel plane3 city10 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 18
23. (debark person17 plane3 city10)
   deleted: (in person17 plane3)
   added: (at person17 city10)
   goals met: 8 of 18
24. (fly plane3 city10 city11 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city11) (fuel-level plane3 fl0)
   goals met: 9 of 18
25. (zoom plane1 city24 city12 fl4 fl3 fl2)
   deleted: (at plane1 city24) (fuel-level plane1 fl4)
   added: (at plane1 city12) (fuel-level plane1 fl2)
   goals met: 9 of 18
26. (board person10 plane1 city12)
   deleted: (at person10 city12)
   added: (in person10 plane1)
   goals met: 9 of 18
27. (zoom plane5 city24 city16 fl4 fl3 fl2)
   deleted: (at plane5 city24) (fuel-level plane5 fl4)
   added: (at plane5 city16) (fuel-level plane5 fl2)
   goals met: 9 of 18
28. (board person2 plane5 city16)
   deleted: (at person2 city16)
   added: (in person2 plane5)
   goals met: 9 of 18
29. (zoom plane5 city16 city10 fl2 fl1 fl0)
   deleted: (at plane5 city16) (fuel-level plane5 fl2)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 9 of 18
30. (zoom plane6 city13 city17 fl3 fl2 fl1)
   deleted: (at plane6 city13) (fuel-level plane6 fl3)
   added: (at plane6 city17) (fuel-level plane6 fl1)
   goals met: 9 of 18
31. (board person3 plane6 city17)
   deleted: (at person3 city17)
   added: (in person3 plane6)
   goals met: 9 of 18
32. (debark person2 plane5 city10)
   deleted: (in person2 plane5)
   added: (at person2 city10)
   goals met: 10 of 18
33. (fly plane6 city17 city23 fl1 fl0)
   deleted: (at plane6 city17) (fuel-level plane6 fl1)
   added: (at plane6 city23) (fuel-level plane6 fl0)
   goals met: 10 of 18
34. (refuel plane6 city23 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 10 of 18
35. (board person9 plane6 city23)
   deleted: (at person9 city23)
   added: (in person9 plane6)
   goals met: 10 of 18
36. (board person6 plane6 city23)
   deleted: (at person6 city23)
   added: (in person6 plane6)
   goals met: 10 of 18
37. (fly plane6 city23 city19 fl1 fl0)
   deleted: (at plane6 city23) (fuel-level plane6 fl1)
   added: (at plane6 city19) (fuel-level plane6 fl0)
   goals met: 10 of 18
38. (refuel plane6 city19 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 10 of 18
39. (debark person9 plane6 city19)
   deleted: (in person9 plane6)
   added: (at person9 city19)
   goals met: 11 of 18
40. (debark person3 plane6 city19)
   deleted: (in person3 plane6)
   added: (at person3 city19)
   goals met: 12 of 18
41. (fly plane6 city19 city3 fl1 fl0)
   deleted: (at plane6 city19) (fuel-level plane6 fl1)
   added: (at plane6 city3) (fuel-level plane6 fl0)
   goals met: 12 of 18
42. (refuel plane6 city3 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 12 of 18
43. (board person16 plane6 city3)
   deleted: (at person16 city3)
   added: (in person16 plane6)
   goals met: 12 of 18
44. (fly plane6 city3 city23 fl1 fl0)
   deleted: (at plane6 city3) (fuel-level plane6 fl1)
   added: (at plane6 city23) (fuel-level plane6 fl0)
   goals met: 12 of 18
45. (refuel plane6 city23 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 12 of 18
46. (debark person16 plane6 city23)
   deleted: (in person16 plane6)
   added: (at person16 city23)
   goals met: 13 of 18
47. (fly plane6 city23 city7 fl1 fl0)
   deleted: (at plane6 city23) (fuel-level plane6 fl1)
   added: (at plane6 city7) (fuel-level plane6 fl0)
   goals met: 13 of 18
48. (debark person6 plane6 city7)
   deleted: (in person6 plane6)
   added: (at person6 city7)
   goals met: 14 of 18
49. (zoom plane1 city12 city5 fl2 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl2)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 14 of 18
50. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 14 of 18
51. (board person5 plane1 city5)
   deleted: (at person5 city5)
   added: (in person5 plane1)
   goals met: 14 of 18
52. (board person4 plane1 city5)
   deleted: (at person4 city5)
   added: (in person4 plane1)
   goals met: 14 of 18
53. (board person12 plane1 city5)
   deleted: (at person12 city5)
   added: (in person12 plane1)
   goals met: 14 of 18
54. (fly plane1 city5 city11 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 14 of 18
55. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 14 of 18
56. (debark person10 plane1 city11)
   deleted: (in person10 plane1)
   added: (at person10 city11)
   goals met: 15 of 18
57. (fly plane1 city11 city12 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city12) (fuel-level plane1 fl0)
   goals met: 15 of 18
58. (refuel plane1 city12 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 18
59. (debark person5 plane1 city12)
   deleted: (in person5 plane1)
   added: (at person5 city12)
   goals met: 16 of 18
60. (fly plane1 city12 city21 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl1)
   added: (at plane1 city21) (fuel-level plane1 fl0)
   goals met: 16 of 18
61. (refuel plane1 city21 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 16 of 18
62. (debark person12 plane1 city21)
   deleted: (in person12 plane1)
   added: (at person12 city21)
   goals met: 17 of 18
63. (fly plane1 city21 city8 fl1 fl0)
   deleted: (at plane1 city21) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 17 of 18
64. (debark person4 plane1 city8)
   deleted: (in person4 plane1)
   added: (at person4 city8)
   goals met: 18 of 18
